/*
SQLyog Community v13.1.6 (64 bit)
MySQL - 5.6.44-log : Database - ant_design_vue_slot_and_style
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`ant_design_vue_slot_and_style` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `ant_design_vue_slot_and_style`;

/*Table structure for table `components` */

DROP TABLE IF EXISTS `components`;

CREATE TABLE `components` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL DEFAULT 'name' COMMENT '组件名称',
  `alias` varchar(100) NOT NULL DEFAULT 'alias' COMMENT '组件别名',
  `category` varchar(100) NOT NULL DEFAULT 'category' COMMENT '组件分类',
  `created_at` datetime NOT NULL DEFAULT '2021-01-01 00:00:00',
  `updated_at` datetime NOT NULL DEFAULT '2021-01-01 00:00:00' COMMENT '组件样式',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8;

/*Data for the table `components` */

insert  into `components`(`id`,`name`,`alias`,`category`,`created_at`,`updated_at`) values 
(1,'Button','按钮','通用组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(2,'Icon','图标','通用组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(3,'Typography.Text','排版字体','通用组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(4,'Typography.Title','排版标题','通用组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(5,'Typography.Paragraph','排版段落','通用组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(6,'Divider','分割线','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(7,'Row','行','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(8,'Col','列','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(9,'Layout','布局','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(10,'Layout.Sider','侧边栏','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(11,'Space','间距','布局组件','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(12,'Affix','固定','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(13,'Breadcrumb','面包屑','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(14,'Breadcrumb.Item','面包屑项','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(15,'Dropdown','下拉菜单','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(16,'Dropdown.Button','下拉菜单按钮','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(17,'Menu','导航菜单','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(18,'Menu.Item','导航菜单项','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(19,'Menu.SubMenu','次级导航菜单','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(20,'Menu.ItemGroup','导航菜单组','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(21,'PageHeader','页头','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(22,'Pagination','分页','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(23,'Steps','步骤条','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(24,'Steps.Step','步骤条项','导航','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(25,'AutoComplete','自动完成','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(26,'Cascader','级联选择','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(27,'Checkbox','复选框','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(28,'Checkbox Group','复选框组','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(29,'DatePicker','日期选择器','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(30,'Form','表单','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(31,'Form.Item','表单项','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(32,'Input','输入框','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(33,'InputNumber','数字输入框','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(34,'Mentions','提及','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(35,'Radio','单选框','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(36,'RadioGroup','单选框组','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(37,'Rate','评分','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(38,'Select','选择器','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(39,'Option','选择器项','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(40,'OptGrou','选择器项组','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(41,'Slider','滑块输入条','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(42,'Switch','开关','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(43,'TimePicker','时间选择器','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(44,'Transfer','穿梭框','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(45,'TresSelect','树选择器','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(46,'Upload','上传','数据录入','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(47,'Avatar','头像','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(48,'Badge','徽标数','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(49,'Badge.Ribbon','徽章','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(50,'Calendar','日历','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(51,'Card','卡片','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(52,'Card.Meta','卡片元信息','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(53,'Carouser','走马灯','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(54,'Collapse','折叠面板','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(55,'Collapse.Panel','折叠面板项','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(56,'Comment','评论','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(57,'Descriptions','描述列表','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(58,'DescriptionsItem','描述列表项','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(59,'Empty','空状态','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(60,'Image','图片','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(61,'List','列表','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(62,'List grid','列表表格','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(63,'List.Item','列表项','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(64,'List.Item.Meta','列表项元信息','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(65,'Popover','气泡卡片','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(66,'Statistic','统计数值','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(67,'Statistic.Countdown','统计数值倒计时','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(68,'Table','表格','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(69,'Tabs','标签页','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(70,'Tabs.TabPane','标签页项','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(71,'Tag','标签','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(72,'Tag.CheckableTag','可选择标签','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(73,'Timeline','时间轴','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(74,'Timeline.Item','时间轴项','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(75,'Tooltip','文字提示','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(76,'Tree','树形控件','数据展示','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(77,'Alert','警告提示','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(78,'Drawer','抽屉','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(79,'Modal','对话框','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(80,'Popconfirm','气泡确认框','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(81,'Progress','进度条','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(82,'Result','结果','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(83,'Skeleton','骨架屏','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(84,'SkeletonAvatarProps','骨架屏化身','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(85,'SkeletonTitle','骨架屏标题','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(86,'SkeletonParagraph','骨架屏段落','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(87,'Spin','加载中','反馈','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(88,'Anchor','锚点','其他','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(89,'BackTop','回到顶部','其他','2021-01-01 00:00:00','2021-01-01 00:00:00'),
(90,'ConfigProvider','全局化配置','其他','2021-01-01 00:00:00','2021-01-01 00:00:00');

/*Table structure for table `props` */

DROP TABLE IF EXISTS `props`;

CREATE TABLE `props` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `component_id` int(11) NOT NULL DEFAULT '1' COMMENT '组件id',
  `prop` varchar(100) NOT NULL DEFAULT 'prop' COMMENT '组件属性',
  `alias` varchar(100) NOT NULL DEFAULT 'alias' COMMENT '组件属性别名',
  `type` varchar(100) NOT NULL DEFAULT 'type' COMMENT '属性类型',
  `default` varchar(100) NOT NULL DEFAULT 'default' COMMENT '默认值',
  `style` text COMMENT '组件样式',
  `created_at` datetime NOT NULL DEFAULT '2021-01-01 00:00:00',
  `updated_at` datetime DEFAULT '2021-01-01 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `props` */

insert  into `props`(`id`,`component_id`,`prop`,`alias`,`type`,`default`,`style`,`created_at`,`updated_at`) values 
(1,1,'type','按钮类型','[\"string\"]','default',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00'),
(2,1,'ghost','镂空','[\"boolean\"]','false',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00'),
(3,1,'size','尺寸','[\"string\"]','default',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00'),
(4,1,'disabled','不可用状态','[\"boolean\"]','false',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00'),
(5,1,'shape','形状','[\"string\"]','default',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00'),
(6,1,'block','块按钮','[\"booean\"]','false',NULL,'2021-01-01 00:00:00','2021-01-01 00:00:00');

/*Table structure for table `slots` */

DROP TABLE IF EXISTS `slots`;

CREATE TABLE `slots` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `component_id` int(11) NOT NULL DEFAULT '1' COMMENT '组件id',
  `paramas` varchar(255) DEFAULT NULL COMMENT '插槽参数',
  `name` varchar(100) NOT NULL DEFAULT 'name' COMMENT '插槽名称',
  `style` text NOT NULL COMMENT '插槽外层样式',
  `created_at` datetime NOT NULL DEFAULT '2021-01-01 00:00:00',
  `updated_at` datetime NOT NULL DEFAULT '2021-01-01 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `slots` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
